In [1]:
import pandas as pd


data_a = {
    'id': ['1', '2', '3'],
    'first': ['Alex', 'Amy', 'Allen'],
    'last': ['Anderson', 'Ackerman', 'Ali']
}

dataframe_a = pd.DataFrame(data_a, columns=['id', 'first', 'last'])

data_b = {
    'id': ['4', '5', '6'],
    'first': ['Billy', 'Brian', 'Bobby'],
    'last': ['Bonder', 'Black', 'Balwner']
}

dataframe_b = pd.DataFrame(data_b, columns=['id', 'first', 'last'])

In [2]:
pd.concat([dataframe_a, dataframe_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6  Bobby   Balwner

In [4]:
row = pd.Series([10, 'Chris', 'Chillon'], index=['id', 'first', 'last'])

# dataframe_b.append(row, ignore_index=True)



---

To apply an internal merge we use the *merge* method with the *on* parameter specifying the column by which the merge occurs.

In [6]:
employee_data = {
    'employee_id': ['1', '2', '3', '4'],
    'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']
}

dataframe_employees = pd.DataFrame(employee_data, columns=['employee_id', 'name'])

sales_data = {'employee_id': ['3', '4', '5', '6'],
              'total_sales': [23, 25, 24, 15]
}

dataframe_sales = pd.DataFrame(sales_data, columns=['employee_id',  'total sales'])

In [7]:
dataframe_employees

  employee_id        name
0           1   Amy Jones
1           2  Allen Keys
2           3  Alice Bees
3           4  Tim Horton

In [8]:
dataframe_sales

  employee_id total sales
0           3         NaN
1           4         NaN
2           5         NaN
3           6         NaN

In [9]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer')
# how:
# inner - returns rows common for data frames
# outer - returns all rows; if a row of one data frame is absent in other - return NaN
# left - returns all rows from left data frame and common rows from right data frame
# right - returns all rows from right data frame and common rows from left data frame

  employee_id        name total sales
0           1   Amy Jones         NaN
1           2  Allen Keys         NaN
2           3  Alice Bees         NaN
3           4  Tim Horton         NaN
4           5         NaN         NaN
5           6         NaN         NaN

In [10]:
pd.merge(dataframe_employees, dataframe_sales, left_on='employee_id', right_on='employee_id')

  employee_id        name total sales
0           3  Alice Bees         NaN
1           4  Tim Horton         NaN